In [1]:
from api_data_fetcher import MyAPI
from database_handler import MySQL
from feature_engineering import TechnicalIndicatorGenerator

import warnings
warnings.filterwarnings("ignore")

In [2]:
api = MyAPI()

In [3]:
df_stock = api.get_stock(symbol = 'IBM', size = 'full')
df_crypto = api.get_crypto(symbol = 'BTC', market = 'USD', size = 'full')

In [4]:
df_stock.head()

              open    high     low   close   volume
timestamp
2025-05-15  259.05  267.43  258.61  266.67  4852910
2025-05-14  257.60  260.55  256.22  257.82  3635124
2025-05-13  254.43  259.58  252.88  258.59  3521389
2025-05-12  252.50  253.81  244.65  253.69  4609520
2025-05-09  252.51  253.00  247.64  249.20  2901346

In [5]:
df_crypto.head()

             open     high      low  close   volume
timestamp
2025-05-15  45.42  46.1700  44.9300  45.70   667812
2025-05-14  46.11  46.2500  45.4650  45.77  1020446
2025-05-13  45.97  46.5535  45.5800  46.45  1246796
2025-05-12  46.13  46.3300  44.6554  45.11  1179521
2025-05-09  45.63  46.0050  45.3600  45.75  1311055

In [6]:
mysql = MySQL()

In [7]:
mysql.to_table(df_stock, 'ibm', if_exists = 'replace')

Data inserted into table 'ibm' successfully.

In [8]:
df_stock_new = mysql.from_table(symbol = 'ibm')
df_stock_new.head()

Data retrieved from table 'ibm' successfully.

     open    high     low   close   volume
0  259.05  267.43  258.61  266.67  4852910
1  257.60  260.55  256.22  257.82  3635124
2  254.43  259.58  252.88  258.59  3521389
3  252.50  253.81  244.65  253.69  4609520
4  252.51  253.00  247.64  249.20  2901346

In [9]:
df_crypto.head()

             open     high      low  close   volume
timestamp
2025-05-15  45.42  46.1700  44.9300  45.70   667812
2025-05-14  46.11  46.2500  45.4650  45.77  1020446
2025-05-13  45.97  46.5535  45.5800  46.45  1246796
2025-05-12  46.13  46.3300  44.6554  45.11  1179521
2025-05-09  45.63  46.0050  45.3600  45.75  1311055

In [10]:
ind = TechnicalIndicatorGenerator()

In [11]:
df = ind.generate_indicators(df_stock_new)

In [12]:
df.head()

,open,high,low,close,volume,hl2,hlc3,ohlc4,ema_10_close,sma_10_close,...,TRIXs_30_9,UO_7_14_28,WMA_10,inc,dec,cdl_doji,price_range,body,range_ratio,class
199,191.48,192.7700,189.090,191.04,3064978,190.9300,190.966667,191.0950,190.267660,189.241,...,-0.232332,48.309880,189.310000,0,1,0,3.6800,0.44,0.119565,1
200,193.18,193.2900,189.180,191.50,3336806,191.2350,191.323333,191.7875,190.491722,189.443,...,-0.237851,53.664967,189.720727,0,1,0,4.1100,1.68,0.408759,1
201,190.51,193.5700,189.622,191.75,4294875,191.5960,191.647333,191.3630,190.720500,189.473,...,-0.242874,53.193344,190.140182,1,0,0,3.9480,1.24,0.314083,-1
202,186.80,196.2600,185.300,191.98,9532802,190.7800,191.180000,190.0850,190.949500,189.410,...,-0.247304,56.447254,190.596000,1,0,0,10.9600,5.18,0.472628,-1
203,184.14,185.0714,183.145,184.02,6962071,184.1082,184.078800,184.0941,189.689591,189.132,...,-0.251177,45.575686,189.616000,0,1,100,1.9264,0.12,0.062292,-1

In [13]:
df['class'].value_counts()

class
-1    3171
 1    3034
Name: count, dtype: int64

In [14]:
df_stock_new.shape

(6424, 48)

In [15]:
from model_trainer import ModelPipeline

In [16]:
model = ModelPipeline()

In [17]:
model.vertical_split(df, 'class')

In [ ]:
results = model.train_with_kfold()

Applying PCA feature selection...
Applying Dispersion_Ratio feature selection...
Applying Chi_Square feature selection...
Applying Pearson_Correlation feature selection...
Applying Mean_Absolute_Difference feature selection...
Applying Low_Variance feature selection...
Evaluating features selected by at least 1 methods...
Threshold n=1: 111 features, accuracy = 0.7955
Evaluating features selected by at least 2 methods...